# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge on one-to-many and many-to-many relationships!

## Objectives

You will be able to:
- Query data using one-to-many and many-to-many joins
- Predict the resulting size of one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [2]:
import pandas as pd
import sqlite3
conn = sqlite3.connect('data.sqlite')
c = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a list of all of the employees with their first name, last name and the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [18]:
#Your code here
c.execute("""SELECT firstName, lastName, city, state FROM employees JOIN offices USING (officecode) ORDER BY firstname asc""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

23

## Customers and their Orders (a One-to-Many join)

Return a list of all the customers first and last names along with a record for each of their order numbers, order dates and statuses.

In [17]:
c.execute("""SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
            FROM customers
            JOIN orders
            USING (customerNumber)""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

326

## Customers and their Payments (another One-to-Many join)

Return a list of customers first and last names along with details about their payments including the amount and date of payments. Sort these results in descending order by the payment amount.

In [22]:
c.execute("""SELECT contactfirstName, contactlastName, checkNumber, amount, paymentDate FROM customers JOIN payments USING (customernumber);""")

df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
len(df)

273

## Orders, Order details and Product Details (a Many-to-Many Join)

Return a list of customer first and last names, product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries which can make complex queries such as this much simpler!

In [30]:
c.execute("""SELECT contactFirstName, 
                    contactLastName, 
                    productName, 
                    quantityOrdered, 
                    orderDate 
            FROM customers
            JOIN orders
            USING (customerNumber)
            JOIN orderdetails
            USING (orderNumber)
            JOIN products
            USING (productCode)""")


df = pd.DataFrame(c.fetchall())
df.columns = [i[0] for i in c.description]
df.head(30)

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Carine,Schmitt,1965 Aston Martin DB5,26,2003-05-20
1,Carine,Schmitt,1999 Indy 500 Monte Carlo SS,46,2003-05-20
2,Carine,Schmitt,1948 Porsche Type 356 Roadster,34,2003-05-20
3,Carine,Schmitt,1966 Shelby Cobra 427 S/C,50,2003-05-20
4,Carine,Schmitt,1996 Moto Guzzi 1100i,39,2004-09-27
5,Carine,Schmitt,1936 Harley Davidson El Knucklehead,32,2004-09-27
6,Carine,Schmitt,1938 Cadillac V-16 Presidential Limousine,43,2004-11-25
7,Jean,King,1917 Grand Touring Sedan,21,2003-05-21
8,Jean,King,1911 Ford Town Car,42,2003-05-21
9,Jean,King,1932 Model A Ford J-Coupe,42,2003-05-21
10,Jean,King,1932 Alfa Romeo 8C2300 Spider Sport,36,2003-05-21
11,Jean,King,1957 Ford Thunderbird,23,2003-05-21
12,Jean,King,1970 Chevy Chevelle SS 454,22,2003-05-21
13,Jean,King,1939 Chevrolet Deluxe Coupe,45,2003-05-21
14,Jean,King,1938 Cadillac V-16 Presidential Limousine,22,2003-05-21
15,Jean,King,1949 Jaguar XK 120,32,2003-05-21
16,Jean,King,1952 Citroen-15CV,25,2003-05-21
17,Jean,King,1969 Chevrolet Camaro Z28,49,2003-05-21
18,Jean,King,2002 Chevy Corvette,43,2003-05-21
19,Jean,King,1936 Mercedes Benz 500k Roadster,46,2003-05-21
20,Jean,King,1993 Mazda RX-7,34,2004-08-06
21,Jean,King,1965 Aston Martin DB5,23,2004-08-06
22,Jean,King,1948 Porsche 356-A Roadster,29,2004-08-06
23,Jean,King,1995 Honda Civic,29,2004-08-06
24,Jean,King,1999 Indy 500 Monte Carlo SS,39,2004-08-06
25,Jean,King,1992 Ferrari 360 Spider red,42,2004-08-06
26,Jean,King,1948 Porsche Type 356 Roadster,31,2004-08-06
27,Jean,King,1966 Shelby Cobra 427 S/C,35,2004-08-06
28,Jean,King,1982 Lamborghini Diablo,31,2004-08-06
29,Jean,King,1956 Porsche 356A Coupe,25,2004-08-06

## Summary

In this lab, you practiced your knowledge on one-to-many and many-to-many relationships!